Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/bringing_pets_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Bringing pets to Ireland
ga: Peataí a thabhairt go hÉirinn

source: • Cats, dogs and ferrets
ga: • Cait, madraí agus firéid

source: • How to apply • Where to apply
ga: • Cá háit a ndéanfaidh mé iarratas

source: The importation of pets into Ireland has always been strictly controlled to ensure that diseases such as rabies are not introduced
ga: Bhí rialacha daingne riamh ag baint le peataí a thabhairt isteach in Éirinn, lena chinntiú nach dtaharfaí galair ar nós confaidh isteach sa tír

source: The EU system of Passports for Pets allows cats, dogs and ferrets to travel between EU member states
ga: Tugann an córas an AE maidir le Pasanna do Pheataí cead do chait, do mhadraí agus d’fhiréid taisteal idir ballstáit an AE

source: Pets from higher risk non-EU countries will also require a blood test - see 'Non-qualifying high-risk countries' below
ga: Beidh gá le tástail fola a dhéanamh ar pheataí ó thíortha ardbhaoil neamh-AE – féach ‘Tíortha neamh-incháilithe ardbhaoil’ thíos

source: Cats, dogs and ferrets
ga: Cait, madraí agus firéid

source: If you are coming on holiday or to move to Ireland or other non-commercial movement where there is no sale or change of ownership, you may bring your cat, dog or ferret with you
ga: Má tá tú ag teacht go hÉirinn ar laethanta saoire nó má bhogann tú go hÉirinn nó má dhéanann tú aistriú eile neamhthráchtála nach ndéantar díol nó athrú úinéireachta, féadfaidh tú do chat, do mhadra nó d’fhiréad a thabhairt leat

source: Since 28 December 2014, under the Pet Passport (No
ga: Ón 28 Nollaig 2014, faoi na Rialacháin um Pas Peata (Uimh

source: 2) Regulations there are changes to the rules governing the non-commercial movement of cats, dogs and ferrets
ga: 2), rinneadh athruithe ar na rialacha a rialaíonn aistriú neamhthráchtála cat, madraí agus firéad

source: Pets from EU member states
ga: Peataí as ballstáit an AE

source: If you want to import a cat, dog or ferret into Ireland from any EU member state including the UK, the pet animal must have an EU Pet Passport, (this document is the same throughout the EU)
ga: Más mian leat madra, cat nó firéad a thabhairt isteach in Éirinn as aon bhallstát/limistéar de chuid an AE, lena n-áirítear an RA, ní mór duit Pas Peata an AE a bheith agat don pheata, (tá an doiciméad seo mar a chéile ar fud an AE)

source: • The pet is travelling from an eligible country
ga: • Go bhfuil an peata ag taisteal ó thír incháilithe

source: • The pet is identified by an implanted microchip
ga: • Go bhfuil micrishlis aitheantais ionchlannaithe sa pheata

source: • The pet has been vaccinated against rabies subsequently at least 21 days before travel
ga: • Go ndearnadh an peata a vacsaíniú in aghaidh confaidh laistigh de 21 lá sular thaistil an peata

source: • Dogs coming from countries other than the UK, Finland or Malta have been treated against tapeworm between 24 and 120 hours before travel
ga: • Ní mór cóir leighis a chur ar mhadraí i leith péist ribíníneach idir 24 agus 120 uair an chloig roimh thráth an taistil agus ní mór am agus dáta na córa a iontráil ar an bpas

source: The time and date of treatment are entered on the passport. Treatment for ticks is not compulsory but it is advisable to get it at the same time as the tapeworm treatment
ga: Níl cóir leighis i leith sceartán éigeantach ach moltar é a dhéanamh ag an tráth céanna a chuirtear an chóir ar an madra in aghaidh péist ribíneach

source: If there are more than 5 animals, a veterinary health certificate showing that animals have been clinically examined within 48 hours of departure is also required unless the owner can show proof that the animals are being brought to compete in a sporting event or other competition
ga: Má tá breis agus 5 ainmhí ann, teastaíonn deimhniú sláinte tréidliachta, chomh maith, ina léirítear go ndearnadh scrúdú cliniciúil ar ainmhí laistigh de 48 uair an chloig tar éis imeachta, murar féidir an t-úinéir cruthúnas a thaispeáint go bhfuil na hainmhithe á dtabhairt isteach go hÉirinn chun dul in iomaíocht in imeacht spóirt nó i gcomórtas eile

source: Pets from outside the EU
ga: Peataí ó áiteanna lasmuigh den AE

source: If you want to import a cat, dog or ferret into Ireland from a country outside the EU there are 2 categories of these countries: qualifying lower-risk countries and non-qualifying high-risk countries
ga: Más mian leat madra nó cat a thabhairt isteach in Éirinn as tír lasmuigh den AE, is ann do 2 chatagóir de na tíortha seo: tíortha incháilithe ísealbhaoil agus tíortha neamh-incháilithe ardbhaoil

source: You can check if your country of origin is on this list of qualifying lower-risk countries
ga: Is féidir leat seiceáil má tá do thír bhunúis ar an liosta tíortha incháilithe ísealbhaoil

source: If it is not on this list then your country of origin is a non-qualifying high-risk country
ga: Mura bhfuil an tír ar an liosta seo, tá do thír bhunúis ar an liosta neamh-incháilithe ardbhaoil

source: Pets from qualifying non-EU countries
ga: Peataí ó thíortha incháilithe neamh-AE

source: A cat, dog or ferret from a qualifying lower-risk non-EU country must undergo the following in this order:
ga: Ní mór an méid a leanas san ord a leanas a dhéanamh le do chat, madra nó firéad ó thír incháilithe ísealbhaoil neamh-AE:

source: • Be identified by a microchip
ga: • Micrishlis a ionchlannadh sa pheata (ní mor é seo a dhéanamh roimh aon rud eile)

source: • Be vaccinated for rabies subsequently
ga: • An peata a vacsaíniú in aghaidh confaidh ina dhiaidh sin

source: • Have a veterinary health certificate in the form of Annex IV to Commission Implementing Decision 577/2013 to certify that it is currently immunised against rabies and dogs must be treated against tapeworm between 24 and 120 hours before arriving in Ireland
ga: • Deimhniú sláinte tréidliachta a bheith acu, i bhfoirm Iarscríbhinn IV le Cinneadh 577/2013 an Choimisiúin a chur chun feidhme lena dheimhniú go bhfuil an t-ainmhí imdhíonta faoi láthair i leith confaidh agus ní mór cóireáil a chur ar mhadraí i leith péist ribíneach idir 24 agus 120 uair an chloig sula dtagann siad go hÉirinn

source: Treatment for ticks is not compulsory but it is advisable to get it at the same time as the tapeworm treatment
ga: Níl cóir leighis i leith sceartán éigeantach ach moltar é a dhéanamh ag an tráth céanna a chuirtear an chóir ar an madra in aghaidh péist ribíneach

source: If you are coming from a non-qualifying high-risk country your pet must:
ga: Más ag teacht ó thíor neamh-incháilithe ardbhaoil atá tú, ní mór an méid a leanas a dhéanamh le do pheata:

source: • Be microchipped (this must be done before anything else)
ga: • Micrishlis a ionchlannadh sa pheata (ní mor é seo a dhéanamh roimh aon rud eile)

source: • Have a blood test after the rabies vaccination at least 3 months before entry
ga: • Tástáil fola a dhéanamh ar an bpeata i ndiaidh an vacsaínithe in aghaidh confaidh ar a laghad 3 mhí sula mbaineann an peata tír an chinn scríbe amach

source: • Have a veterinary health certificate in the form of Annex IV to Commission Implementing Decision 577/2013 to certify that it is currently immunised against rabies and dogs must be treated against tapeworm not more than 120 hours and not less than 24 hours before arriving in Ireland
ga: • Deimhniú sláinte tréidliachta a bheith ag do pheata, i bhfoirm Iarscríbhinn IV le Cinneadh 577/2013 an Choimisiúin a chur chun feidhme lena dheimhniú go ndearnadh an t-ainmhí a imdhíonadh i leith confaidh agus ní mór gur cuireadh cóir ar mhadraí i leith péist ribíneach tráth nach mó ná 120 uair an chloig agus nach lú ná 24 uair an chloig sular tháinig siad go hÉirinn

source: There is more information about bringing cats, dogs or ferrets into Ireland on the website of the Department of Agriculture, Food and the Marine
ga: Tá níos mó faisnéise faoi chait, madraí nó firéid a thabhairt isteach go hÉirinn ar láithreán gréasáin na Roinne Talmhaíochta, Bia agus Mara

source: Pet birds, rabbits and rodents
ga: Peataí éan, coiníní agus creimirí

source: If you are moving to live in Ireland or coming here on holiday, you may be able to bring your pet bird, rabbit or rodent with you, provided you meet certain requirements – see ‘How to apply’ below
ga: Más rud é go bhfuil tú ag bogadh chun cónaí in Éirinn nó ag teacht anseo ar saoire, is féidir go mbeidh tú ábalta do pheata éin, coinín nó creimire a thabhairt leat, ar choinníoll go gcomhlíonann tú riachtanais áirithe - féach ‘Conas iarratas a dhéanamh’ thíos

source: There is more information about the entry requirements for birds, rabbits and rodents either from EU or from outside the EU on the website of the Department of Agriculture, Food and the Marine
ga: Is ann do thuilleadh faisnéise faoi na riachtanais iontrála maidir le héin, coiníní agus creimirí ón AE nó ó áiteanna lasmuigh den AE ar láithreán Gréasáin na Roinne Talmhaíochta, Bia agus Mara

source: The operator of the airline or ferry company is legally obliged under the Pet Passport (No2) Regulations 2014 to notify the arrival of the animals to the Department of Agriculture, Food and the Marine by email at least 24 hours in advance to petmove@agriculture.gov.ie
ga: Tá dualgas ar oibreoir na haerlíne nó na cuideachta farantóireachta, faoi na Rialacháin um Pas Peata (Uimh. 2), 2014 chun teacht isteach na n-ainmhithe a chur in iúl don Roinn Talmhaíochta, Bia agus Mara trí ríomhphost a sheoladh chucu ar a laghad 24 uair an chloig roimh ré, chuig petmove@agriculture.gov.ie

source: Airlines registered with the Department may choose to carry pets complying with the above regulations
ga: Is féidir le haerlínte atá cláraithe leis an Roinn an cinneadh a dhéanamh chun peataí a iompar a chomhlíonann na rialacháin thuas

source: Compliant pets may travel on any ferry
ga: Is féidir le peataí comhlíontacha taisteal ar aon bhád farantóireachta

source: The pet must travel with its owner or with a person acting on behalf of the owner (unaccompanied pets cannot travel to Ireland under the EU Pet Passport System)
ga: Ní mór don pheata taisteal lena (h)úinéir nó le duine atá ag gníomhú thar ceann an úinéara (ní féidir le peataí taisteal go hÉirinn leo féin faoi Chóras Phas Peata an AE)

source: Travel from outside the EU
ga: Taisteal ó áiteanna lasmuigh den AE

source: The animal must be transported by air to Ireland on an approved airline or pet cargo carrier
ga: Ní mór go ndéanfaidh aerlíne fhaofa nó iompróir lastais an t-ainmhí a iompar go hÉirinn san aer

source: You must provide evidence to the airline in advance that your pet is travelling with you for non-commercial purposes
ga: Ní mór duit fianaise a sholáthar don aerlíne roimh ré go bhfuil do pheata ag taisteal leat ar mhaithe le cuspóirí neamhthráchtála

source: Entry to Ireland is by airline into Dublin airport where the pet is checked to see if it is compliant with the entry requirements
ga: Trí aerlíne is ea iontráil go hÉirinn isteach in aerfort Bhaile Átha Cliath, áit a seiceáiltear an peata lena dheimhniú an gcomhlíonann an peata na riachtanais iontrála

source: If the pet does not meet the entry requirements it will be returned to the country of origin at the owner's expense
ga: Mura gcomhlíonann an peata na bunriachtanais, cuirfear an peata ar ais chuig an tír bhunúis ar chostas an úinéara

source: If you are importing a pet cat, dog or ferret into Ireland from an EU member state or certain other EU countries, you should arrange for your veterinarian to microchip and then vaccinate the pet in that order, and obtain an EU Pet Passport from the competent authority in the EU member state of origin
ga: Má tá peata cait, madra nó firéid á iompórtáil agat isteach in Éirinn ó bhallstát den AE nó ó thíortha áirithe eile den AE, ba cheart duit a shocrú le do thréidlia micrishlis a ionchlannadh sa pheata agus é/í a vacsaíniú (san ord sin), agus Pas Peata an AE a fháil ón údarás inniúil sa bhallstát bunúis den AE

source: If you are importing a pet cat, dog or ferret into Ireland from a qualifying low-risk country, you should arrange for your veterinarian to microchip and then vaccinate the pet in that order
ga: Má tá peata cait, madra nó firéid á iompórtáil agat isteach in Éirinn ó thír incháilithe ísealbhaoil, ba cheart duit a shocrú le do thréidlia micrishlis a ionchlannadh sa pheata agus ansin an peata a vacsaíniú (san ord sin)

source: If you are importing a pet cat, dog or ferret into Ireland from a non-qualifying high-risk country, you should arrange for your veterinarian to microchip, vaccinate and then bloodtest the pet in that order
ga: Má tá peata cait, madra nó firéid á iompórtáil agat isteach in Éirinn ó thíor neamh-incháilithe ardbhaoil, ba cheart duit a shocrú le do thréidlia micrishlis a ionchlannadh sa pheata, an peata a vacsaíniú agus ansin tástáil fola a dhéanamh ar an bpeata (san ord sin)

source: Contact a local veterinarian or the competent authority for information on the veterinary health certificate in the form of Annex IV to Commission Implementing Decision 577/2013
ga: Déan teagmháil le tréidlia nó leis an údarás inniúil chun teacht ar fhaisnéis ar an deimhniú sláinte tréidliachta i bhfoirm Iarscríbhinn IV le Cinneadh an Choimisiúin a chur chun feidhme

source: If you are bringing a pet bird, rabbit or rodent to Ireland from another EU state or a relevant European state you must accompany the pet to Ireland
ga: Más rud é go bhfuil tú ag tabhairt peata éin, coinín nó creimire go hÉirinn ó stát eile den AE nó ó stát Eorpach ábhartha, ní mór duit teacht in éineacht leis an bpeata go hÉirinn

source: At least 24 hours before you arrive in Ireland you must send a completed advance notice of importation into Ireland form for pet birds or for a pet rodent or rabbit to the Animal Health and Welfare Division, Department of Agriculture, Food and the Marine at the address below
ga: Ní mór duit, 24 uair ar a laghad sula dtagann tú go hÉirinn, foirm chomhlánaithe den Réamhfhógra um Iompórtáil isteach in Éirinnle haghaidh peataí éan nó le haghaidh peata coinín nó creimire a sheoladh chuig an Rannóg Sláinte agus Leas Ainmhithe, an Roinn Talmhaíochta, Bia agus Mara, ag an seoladh thíos

source: Owners of pet birds must also travel with a completed Owner Declaration for Pet Birds form
ga: Ní mór d’úinéirí peataí éan taisteal le foirm chomhlánaithe Dearbhú Úinéara do Pheataí Éan

source: If you wish to bring a pet bird, rabbit or rodent from a country outside the EU, you must apply for an import permit using either the form for a pet bird or the form for a pet rabbit or rodent
ga: Más mian leat peata éin, coinín nó creimire a thabhairt leat ó thír lasmuigh den AE, ní mór duit iarratas a dhéanamh ar chead iompórtála trí úsáid a bhaint as an bhfoirm le haghaidh peata éin nó as an bhfoirm le haghaidh peata coinín nó creimire

source: You should send the application to the Animal Health and Welfare Division, Department of Agriculture, Food and the Marine, at the address below, in sufficient time to allow the pre-export requirements, which include a veterinary health certificate, to be completed
ga: Ba cheart duit an t-iarratas a sheoladh chuig an Rannóg Sláinte agus Leas Ainmhithe, an Roinn Talmhaíochta, Bia agus Mara, ag an seoladh thíos, tráth dóthanach roimh ré chun am a thabhairt leis na riachtanais réamheaspórtála, lena n-áirítear deimhniú sláinte tréidliachta, a chur i gcrích
